In [1]:
import numpy as np
import pandas as pd
import os

Here we inspect data pertaining to "PETAL POWER" company

In [3]:
os.listdir()
df=pd.read_csv('petal_power.csv')
df.head()

        location  product_type product_description  quantity  price
0  Staten Island         seeds               daisy         4   6.99
1  Staten Island         seeds          calla lily        46  19.99
2  Staten Island         seeds              tomato        85  13.99
3  Staten Island  garden tools                rake         4  13.99
4  Staten Island  garden tools         wheelbarrow         0  89.99

Now we save the first 10 rows belonging to location='Staten Island" in a dataframe.

In [5]:
staten_island=df[df.location=='Staten Island']
staten_island.head()
staten_island.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   location             10 non-null     object
 1   product_type         10 non-null     object
 2   product_description  10 non-null     object
 3   quantity             10 non-null     int64
 4   price                10 non-null     float64
dtypes: float64(1), int64(1), object(3)
memory usage: 480.0+ bytes

A customer just asked to find what products are sold at 'Staten Island' store location.To create a dataframe we do the following.

In [6]:
staten_island_products=staten_island.product_description
print(staten_island_products)

0                         daisy
1                    calla lily
2                        tomato
3                          rake
4                   wheelbarrow
5                         spade
6                 insect killer
7                   weed killer
8    20 inch terracotta planter
9        8 inch plastic planter
Name: product_description, dtype: object

Now we depict all seeds sold at Brooklyn store as follows.

In [10]:
seed_request_brooklyn=df[(df.product_type=='seeds')&(df.location=='Brooklyn')]
seed_request_brooklyn.head()

    location product_type product_description  quantity  price
10  Brooklyn        seeds               daisy        50   6.99
11  Brooklyn        seeds          calla lily         0  19.99
12  Brooklyn        seeds              tomato         0  13.99

Now we add a new column to our intitial dataframe that indicates whether product is available or not.

In [13]:
df['in_stock']=df.quantity>0
df.head()

        location  product_type product_description  quantity  price  in_stock
0  Staten Island         seeds               daisy         4   6.99      True
1  Staten Island         seeds          calla lily        46  19.99      True
2  Staten Island         seeds              tomato        85  13.99      True
3  Staten Island  garden tools                rake         4  13.99      True
4  Staten Island  garden tools         wheelbarrow         0  89.99     False

Now we create a column that indicates total value of individual items.

In [14]:
df['total_value']=df.price*df.quantity
df.head()

,location,product_type,product_description,quantity,price,in_stock,total_value
0,Staten Island,seeds,daisy,4,6.99,True,27.96
1,Staten Island,seeds,calla lily,46,19.99,True,919.54
2,Staten Island,seeds,tomato,85,13.99,True,1189.15
3,Staten Island,garden tools,rake,4,13.99,True,55.96
4,Staten Island,garden tools,wheelbarrow,0,89.99,False,0.00

The mkt dept wants a complete description of all available products in the inventory along with types.For this we create as follows.

In [15]:
all_description=lambda row:"{pt}-{prod_d}".format(pt=row['product_type'],prod_d=row['product_description'])
df['full_description']=df.apply(all_description,axis=1)
df.head()

,location,product_type,product_description,quantity,price,in_stock,total_value,full_description
0,Staten Island,seeds,daisy,4,6.99,True,27.96,seeds-daisy
1,Staten Island,seeds,calla lily,46,19.99,True,919.54,seeds-calla lily
2,Staten Island,seeds,tomato,85,13.99,True,1189.15,seeds-tomato
3,Staten Island,garden tools,rake,4,13.99,True,55.96,garden tools-rake
4,Staten Island,garden tools,wheelbarrow,0,89.99,False,0.00,garden tools-wheelbarrow